AUTO_config_TK_pesok/src/DataProcessors/КорректностьЗаполненияСправочников/КорректностьЗаполненияСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КорректностьЗаполненияСправочников</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Catalogs/РолиСервисДеск/РолиСервисДеск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиСервисДеск</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Создание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРоли</name>
    <type>
      <types>EnumRef.ТипыРолейСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.Посетители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/КорректностьЗаполненияСправочников/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораОтветственный();
	Ответственный = Пользователи.ТекущийПользователь().ФизическоеЛицо;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	ТабДок = Обработки.КорректностьЗаполненияСправочников.ПроверитьКорректностьЗаполненияСправочников(Ответственный);
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтветственный()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РолиСервисДеск.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.РолиСервисДеск КАК РолиСервисДеск
	|ГДЕ
	|	РолиСервисДеск.Выполнение
	|	И НЕ РолиСервисДеск.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РолиСервисДеск.Ответственный.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Элементы.Ответственный.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ответственный"));
	
КонецПроцедуры
